app/controllers/posts_controller.rb

  def index
    @posts = Post.where(parent_id: nil).all
---
SELECT "posts".* FROM "posts"  WHERE "posts"."parent_id" IS NULL

  def create
    @post = Post.new(post_params)

    # @post.name = Post.set_name(@post.parent_id,@post.name)
    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "head", "name", "parent_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "body"], ["created_at", "2014-09-01 08:18:44.192119"], ["head", "head1"], ["name", "subroot1"], ["parent_id", 1], ["updated_at", "2014-09-01 08:18:44.192119"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "head" = ?, "updated_at" = ? WHERE "posts"."id" = 16  [["body", "111sdfgsdgggggg"], ["head", "gsfdggg"], ["updated_at", "2014-09-08 03:27:42.769634"]]

    def set_post
      @post = Post.find_by!(name: params[:names].to_s.split("/").last)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."name" = 'subroot1' LIMIT 1